{"pageProps":{"heading":{"headline":"JMSS Time","byline":"Modernisation and feature development for a prexisting online timetable."},"post":{"slug":"JMSS-Time","content":"\nJMSS Time was a website created in 2017, to let [John Monash Science School (JMSS)](https://jmss.vic.edu.au) students know when their classes are. At the start of 2020 the timetable that JMSS ran on changed, and thus the original JMSS Time website no longer worked. Collective Fullstack was brought in to update the website for the new timetable, as well as to develop extra features to help students in the transition to online and flexible learning over the 2020 COVID-19 lockdown.\n\nStudents found the school's constant switching between onsite and online learning to be confusing, and so to help students we developed a new page on the website to display the online/onsite learning timetable. This site was made with JQuery like the rest of the JMSS Time website.\n\nWe also developed a custom image system, allowing students to set custom backgrounds to the main clock screen. This was a heavily requested feature by students and was met with positive reception when it was rolled out.\n\nThe original JMSS Time website was very large in terms of file size and so took a while to load on the school WiFi. As our final work on the JMSS Time project, we optimised the codebase. This meant rewriting the algorithms used under the hood to calculate the next class, as well as compressing the default background images. These optimisations resulted in a loading time reduction of up to 68.5% on a standard internet connection.\n\n","title":"JMSS Time","images":[{"src":"/s-images/work/Jmss-Time/JMSS-TimeTimetable.png","alt":"The main clock page."},{"src":"/s-images/work/Jmss-Time/JMSS-TimeWeek.png","alt":"A specially designed weekly timetable page for online learning requirements during the 2020 Covid-19 lockdown."},{"src":"/s-images/work/Jmss-Time/JMSS-TimeCustomImage.png","alt":"The Custom image page."}],"mainImage":"/s-images/work/Jmss-Time/JMSS-TimeThumb.png","leadIn":"Modernisation and feature development for a prexisting online timetable.","date":"2020.01","skills":"Website design, Website development, JQuery development.","links":[{"text":"Github","href":"https://github.com/JMSS-Time"},{"text":"Visit JMSS Time","href":"https://jmss-time.github.io"},{"text":"Visit JMSS Time Custom Image","href":"https://jmss-time.github.io/custom-image"}]},"isHomepage":false},"__N_SSG":true}